УправлениеПаркомАттракционов/src/Catalogs/Аттракционы/Аттракционы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Аттракционы</name>
  <attributes>
    <name>ВидАттракциона</name>
    <type>
      <types>CatalogRef.ВидыАттракционов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьФото</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширениеФайлаФото</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>CatalogRef.АттракционыПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФотоПеренесено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

УправлениеПаркомАттракционов/src/Catalogs/Аттракционы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПеренестиФотоВПрисоединенныеФайлы(ПараметрыОбработки) Экспорт
	
	ПараметрыОбработки.ОбработкаЗавершена = Ложь;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 50
	|	Аттракционы.Ссылка
	|ИЗ
	|	Справочник.Аттракционы КАК Аттракционы
	|ГДЕ
	|	Аттракционы.ФотоПеренесено = ЛОЖЬ";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			ДанныеФото = СпрОбъект.УдалитьФото.Получить();
			
			Если ДанныеФото <> Неопределено Тогда
				ПеренестиФотоВПрисоединенныйФайл(СпрОбъект);
			КонецЕсли;
			
			СпрОбъект.ФотоПеренесено = Истина;
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СпрОбъект);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ВызватьИсключение;
			
		КонецПопытки;
		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПеренестиФотоВПрисоединенныйФайл(СпрОбъект)
	
	Спр
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
